KansOptTorg Configuration/src/BusinessProcesses/ПриемНаРаботу/ПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПриемНаРаботу</name>
  <task>Task.ЗадачаПриемаНаРаботу</task>
  <attributes>
    <name>ПрохождениеТестаАдминистрирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеТестаПрограммирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>EnumRef.Вакансии</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

KansOptTorg Configuration/src/Enums/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Вакансии</name>
  <enumValues>
    <name>Программист</name>
  </enumValues>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
</mdclass:Enum>

KansOptTorg Configuration/src/BusinessProcesses/ПриемНаРаботу/ObjectModule.bsl
Процедура ТестНаАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПрохождениеТестаАдминистрирования;
КонецПроцедуры

Процедура ТестНаПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПрохождениеТестаПрограммирования;
КонецПроцедуры

Процедура ВакансияОператораПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Вакансия = Перечисления.Вакансии.Оператор;
КонецПроцедуры

Процедура ВакансияАдминистратораПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Вакансия = Перечисления.Вакансии.Администратор;
КонецПроцедуры

Процедура ВакансияПрограммистаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Вакансия = Перечисления.Вакансии.Программист;
КонецПроцедуры

//Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
//	 
//	Если ПрохождениеТестаПрограммирования тогда
//		
//		Вакансия = Перечисления.Вакансии.Программист;
//		
//	ИначеЕсли ПрохождениеТестаАдминистрирования тогда
//		
//		Вакансия = Перечисления.Вакансии.Администратор;
//		
//	Иначе
//		
//		Вакансия = Перечисления.Вакансии.Оператор;
//		
//	КонецЕсли;
//	
//КонецПроцедуры
